[
  {
    "text": "You receive an email claiming to be from your bank, asking you to click a link to verify your account. The link looks suspicious. Is this email legitimate or phishing?",
    "correct": "Phishing",
    "explanation": "Legitimate banks rarely ask you to verify accounts via email links. Always check the URL and contact the bank directly."
  },
  {
    "text": "An SMS from your phone carrier offers a free upgrade if you reply with your account details. Is this legitimate or phishing?",
    "correct": "Phishing",
    "explanation": "Carriers don't request sensitive information via SMS. Verify offers through official channels."
  },
  {
    "text": "An email from a known colleague asks you to review a document via a shared link. The email domain matches your company’s. Is this legitimate or phishing?",
    "correct": "Legitimate",
    "explanation": "If the domain matches and the request seems reasonable, it’s likely legitimate. Still, verify with the colleague if unsure."
  },
  {
    "text": "You get an email with a subject line 'Urgent: Your account has been compromised!' and a link to reset your password. Is this legitimate or phishing?",
    "correct": "Phishing",
    "explanation": "Urgent language and unsolicited password reset links are common phishing tactics. Contact the service directly."
  },
  {
    "text": "An SMS claims you’ve won a prize and asks you to click a link to claim it. Is this legitimate or phishing?",
    "correct": "Phishing",
    "explanation": "Unsolicited prize offers via SMS are almost always scams. Avoid clicking links and report the message."
  },
  {
    "text": "Your company’s IT department emails you to install a security update via a provided link. The email comes from the official IT domain. Is this legitimate or phishing?",
    "correct": "Legitimate",
    "explanation": "If the email is from a verified company domain and aligns with IT protocols, it’s likely legitimate. Confirm with IT if unsure."
  },
  {
    "text": "An email offers a discount on a popular product but asks for payment details upfront. The sender’s email is a generic domain. Is this legitimate or phishing?",
    "correct": "Phishing",
    "explanation": "Generic domains and upfront payment requests are red flags. Shop only through trusted websites."
  },
  {
    "text": "You receive a text from a delivery service with a tracking link for a package you’re expecting. The link matches the official site. Is this legitimate or phishing?",
    "correct": "Legitimate",
    "explanation": "If the link matches the official delivery service and you’re expecting a package, it’s likely legitimate. Double-check the URL."
  },
  {
    "text": "An email claims your subscription will expire unless you update your payment info via a link. You don’t recall the subscription. Is this legitimate or phishing?",
    "correct": "Phishing",
    "explanation": "Unsolicited subscription renewal notices are common phishing scams. Verify subscriptions directly with the provider."
  },
  {
    "text": "An SMS from your bank asks you to confirm a recent transaction by replying 'YES' or 'NO.' Is this legitimate or phishing?",
    "correct": "Phishing",
    "explanation": "Banks typically don’t use SMS for transaction confirmation in this manner. Contact your bank to verify."
  }
]